#define _CRT_SECURE_NO_WARNINGS 
#include<stdio.h>

//int main()
//{
	//int a = 5 / 2;	//整数除法
	//double a = 5 / 2.0;		//小数除法
	//double a = 5 / 2;	//取模两边必须是整数
	
	
	//算术右移：右边丢弃，左边补原符号位
	//逻辑右移：右边丢弃，左边补零
	//int a = -1;
	//整数的二进制表示有：原码、反码、补码
	//储存到内存的是补码
	//10000000000000000000000000000001（原码）
	//11111111111111111111111111111110（反码—除符号位，其他位按位取反）
	//11111111111111111111111111111111（补码—在反码的基础上加1）
	//11111111111111111111111111111111（向右移位，最右边丢弃，算术移位最左边补符号位）
	/*int b = a >> 1;
	printf("%d %d", a, b);
	return 0;*/

	//左移:左边丢弃，右边补零
	//int a = 5;
	//int b = a << 1;
	//00000000000000000000000000000101
	//00000000000000000000000000001010

	//&-按二进制位与：对应二进制位全1为1
	/*int a = 3;
	int b = 5;
	int c = a & b;*/
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000001
	//显然与完后c=1

	//|-按位或：对应二进制位有1为1
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000111
	//显然或完后c=7

	//^-按位异或：对应二进制位相同为0，相异为1
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000110
	//显然异或完c=6
//}
	//int main()
	//{
	//	int a = 3;
	//	int b = 5;
	//	//0011
	//	//0110
	//	//0101
	//	printf("%d %d\n", a, b);
	//	a = a ^ b;
	//	b = a ^ b;
	//	a = a ^ b;
	//	printf("%d %d\n", a, b);

	//}
	//int main()
	//{
	//	int a = 3;
	//	int b = 5;
	//	a = a + b;
	//	b = a - b;
	//	a = a - b;
	//	printf("%d %d\n", a, b);
	//	return 0;
	//}

//计算整数二进制位为1的个数
//int main()
//{
	//int num = 0;
	//int count = 0;
	//scanf("%d", &num);
//	while(num)
//	{
//		if (num % 2 == 1)
//		{
//			count++;
//		}
//		num = num / 2;
//	}
//	printf("该数的二进制数有%d个数值为1的二进制位\n", count);
//}

//int main()
//{
//	int num = 0;
//	int count = 0;
//	int i = 0;
//
//	scanf("%d", &num);
//	if (num > 1)
//	{
//		for (i = 0; i < 32; i++)
//		{
//			if (((num >> i) & 1) == 1)
//			{
//				count++;
//			}
//		}
//	}
//	else
//	{
//		int b = ~(num - 1);
//		for (i = 0; i < 32; i++)
//		{
//			if (((b >> i) & 1) == 1)
//			{
//				count++;
//			}
//		}
//	}
//	printf("%d\n",count+1); //最高位不取反
//
//	return 0;
//}
//int main()
//{
//	short s = 0;
//	int a = 10;
//
//	printf("%d\n%d", sizeof(s = a + 5), s);
//
//	return 0;
// }
//int main()
//{
//	int a = 11;
//	//00000000000000000000000000001011
//	//1<<2;
//	//00000000000000000000000000000100;
//	a = a | (1 << 2);
//	//00000000000000000000000000001111;
//	//11111111111111111111111111111011;
//	//00000000000000000000000000000100;
//	a = a & (~(1 << 2));
//	//00000000000000000000000000001011;
//
//	int b = ++a;		//前置++,先++后使用，后置++,先使用后++
//	
//	printf("%d", b);
//
//	return 0;
//	
//}
//int main()
//{
//	int a = (int)3.14;
//	printf("%d", a);
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 0;
//	int max = 0;
//
//	b = (a > 5 ? 3 : -3);
//	max = (a > b ? a : b);
//}
//int main()
//{
//	int a = 0;
//	int b = 1;
//	int c = a < b;
//	printf("%d", c);
//
//	return 0;
//}

//void test(int ar[][3])
//{
//	printf("%d\n%d", *(ar), *(ar + 1));
//}
//int main()
//{
//	int ar[2][3] = { {1,2,3},{2,3,4} };
//
//	return 0;
//}

//表示一个学生
struct stu
{
	char name[20];
	int age;
	char id[20];
};

//int main()
//{
//	int a = 10;
//	//使用struct stu这个类型创建了一个学生对象s1，并初始化
//	struct stu s1 = { "zhangzhiwei",20,"20231016" };
//	struct stu *ps = &s1;
//	printf("%s\n", (*ps).name);
//	printf("%s\n", ps->id);
//
//	printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);
//	
//	return 0;
//}
//int main()
//{
//	char c = 1;
//	int b = 0;
//	char a = 0;
//	printf("%u\n", sizeof(++c));
//	printf("%u\n", sizeof(--c));
//	printf("%u\n", sizeof(c<<1));
//	printf("%u\n", sizeof(c >> 1));
//	printf("%u\n", sizeof(c&b));
//	printf("%u\n", sizeof(c&a));
//	printf("%u\n", sizeof(c=a));
//	printf("%u\n", sizeof(c+=c));
//	printf("%u\n", sizeof(~c));
//	printf("%u\n", sizeof(!c));
//	printf("%u\n", sizeof(a%=c));
//
//	return 0;
//}

